<?php

return [
    'maximum_allowed_print_width_exceeded' => 'Превышен максимально допустимый размер ширины печати для данного изображения!',
    'maximum_allowed_print_height_exceeded' => 'Превышен максимально допустимый размер высоты печати для данного изображения!',
    'x-axis_range_limit_exceeded' => 'Превышены пределы допустимого диапазона по горизонтальной оси!',
    'y-axis_range_limit_exceeded' => 'Превышены пределы допустимого диапазона по вертикальной оси!',
    'wrong_filter_format' => 'Неправильный формат фильтра!',
];
