<?php

return [
    '3d_secure_failed' => 'Не пройдена аутентификация по 3-D Secure. При новой попытке оплаты Вам следует пройти аутентификацию, использовать другое платежное средство или обратиться в банк за уточнениями',
    'call_issuer' => 'Оплата данным платежным средством отклонена по неизвестным причинам. Обратитесь в организацию, выпустившую платежное средство',
    'canceled_by_merchant' => 'Оплата отменена продавцом',
    'card_expired' => 'Истек срок действия банковской карты. При новой попытке оплаты Вам следует использовать другое платежное средство',
    'country_forbidden' => 'Нельзя заплатить банковской картой, выпущенной в этой стране. При новой попытке оплаты Вам следует использовать другое платежное средство',
    'expired_on_capture' => 'Истек срок списания оплаты у двухстадийного платежа',
    'expired_on_confirmation' => 'Истек срок оплаты. Повторите платеж',
    'fraud_suspected' => 'Платеж заблокирован из-за подозрения в мошенничестве. При новой попытке оплаты Вам следует использовать другое платежное средство',
    'general_decline' => 'Причина не детализирована',
    'identification_required' => 'Превышены ограничения на платежи для кошелька в Яндекс.Деньгах. При новой попытке оплаты Вам следует идентифицировать кошелек или выбрать другое платежное средство',
    'insufficient_funds' => 'Не хватает денег для оплаты. Вам следует пополнить баланс или использовать другое платежное средство',
    'internal_timeout' => 'Технические неполадки на стороне Яндекс.Кассы: не удалось обработать запрос в течение 30 секунд. Повторите платеж',
    'invalid_card_number' => 'Неправильно указан номер карты',
    'invalid_csc' => 'Неправильно указан код CVV2 (CVC2, CID)',
    'issuer_unavailable' => 'Организация, выпустившая платежное средство, недоступна. При новой попытке оплаты Вам следует использовать другое платежное средство или повторить оплату позже',
    'payment_method_limit_exceeded' => 'Исчерпан лимит платежей для данного платежного средства или вашего магазина. При новой попытке оплаты Вам следует использовать другое платежное средство или повторить оплату на следующий день',
    'payment_method_restricted' => 'Запрещены операции данным платежным средством (например, карта заблокирована из-за утери, кошелек — из-за взлома мошенниками). Вам следует обратиться в организацию, выпустившую платежное средство',
    'permission_revoked' => 'Нельзя провести безакцептное списание: Вами отозвано разрешение на автоплатежи',
    'no_payment_respond' => 'Данные об оплате не получены! Обратитесь к администрации сайта для уточнения деталей о состоянии оплаты',
    'response_status_unknown' => 'Получен неизвестный статус об оплате! Обратитесь к администрации сайта для уточнения деталей о состоянии оплаты'
];
